{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/stem\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/stem\/Relu6_0_output",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "efficientnet-lite0\/model\/stem\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_0\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_0\/Relu6_0_output",
      "K" : 32,
      "blob_biases" : 5,
      "name" : "efficientnet-lite0\/model\/blocks_0\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "efficientnet-lite0\/model\/stem\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_0\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_0\/tpu_batch_normalization_1\/FusedBatchNormV3_0_output",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "efficientnet-lite0\/model\/blocks_0\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "efficientnet-lite0\/model\/blocks_0\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_1\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_1\/Relu6_0_output",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "efficientnet-lite0\/model\/blocks_1\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "efficientnet-lite0\/model\/blocks_0\/tpu_batch_normalization_1\/FusedBatchNormV3_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_1\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_1\/Relu6_1_0_output",
      "K" : 96,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "efficientnet-lite0\/model\/blocks_1\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "efficientnet-lite0\/model\/blocks_1\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_1\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_1\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 96,
      "blob_biases" : 21,
      "name" : "efficientnet-lite0\/model\/blocks_1\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "efficientnet-lite0\/model\/blocks_1\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_2\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_2\/Relu6_0_output",
      "K" : 24,
      "blob_biases" : 25,
      "name" : "efficientnet-lite0\/model\/blocks_2\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "efficientnet-lite0\/model\/blocks_1\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_2\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_2\/Relu6_1_0_output",
      "K" : 144,
      "blob_biases" : 29,
      "name" : "efficientnet-lite0\/model\/blocks_2\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "efficientnet-lite0\/model\/blocks_2\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_2\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_2\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 144,
      "blob_biases" : 33,
      "name" : "efficientnet-lite0\/model\/blocks_2\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "efficientnet-lite0\/model\/blocks_2\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_2\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_1\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_2\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_2\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_2\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_3\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_3\/Relu6_0_output",
      "K" : 24,
      "blob_biases" : 37,
      "name" : "efficientnet-lite0\/model\/blocks_3\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "efficientnet-lite0\/model\/blocks_2\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_3\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_3\/Relu6_1_0_output",
      "K" : 144,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "efficientnet-lite0\/model\/blocks_3\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "efficientnet-lite0\/model\/blocks_3\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_3\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_3\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 144,
      "blob_biases" : 45,
      "name" : "efficientnet-lite0\/model\/blocks_3\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "efficientnet-lite0\/model\/blocks_3\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_4\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_4\/Relu6_0_output",
      "K" : 40,
      "blob_biases" : 49,
      "name" : "efficientnet-lite0\/model\/blocks_4\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "efficientnet-lite0\/model\/blocks_3\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_4\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_4\/Relu6_1_0_output",
      "K" : 240,
      "blob_biases" : 53,
      "name" : "efficientnet-lite0\/model\/blocks_4\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 240,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "efficientnet-lite0\/model\/blocks_4\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_4\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_4\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 240,
      "blob_biases" : 57,
      "name" : "efficientnet-lite0\/model\/blocks_4\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "efficientnet-lite0\/model\/blocks_4\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_4\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_3\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_4\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_4\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_4\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_5\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_5\/Relu6_0_output",
      "K" : 40,
      "blob_biases" : 61,
      "name" : "efficientnet-lite0\/model\/blocks_5\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "efficientnet-lite0\/model\/blocks_4\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_5\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_5\/Relu6_1_0_output",
      "K" : 240,
      "blob_biases" : 65,
      "stride_x" : 2,
      "name" : "efficientnet-lite0\/model\/blocks_5\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 240,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "efficientnet-lite0\/model\/blocks_5\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_5\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_5\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 240,
      "blob_biases" : 69,
      "name" : "efficientnet-lite0\/model\/blocks_5\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "efficientnet-lite0\/model\/blocks_5\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_6\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_6\/Relu6_0_output",
      "K" : 80,
      "blob_biases" : 73,
      "name" : "efficientnet-lite0\/model\/blocks_6\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "efficientnet-lite0\/model\/blocks_5\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_6\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_6\/Relu6_1_0_output",
      "K" : 480,
      "blob_biases" : 77,
      "name" : "efficientnet-lite0\/model\/blocks_6\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "efficientnet-lite0\/model\/blocks_6\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_6\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_6\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 480,
      "blob_biases" : 81,
      "name" : "efficientnet-lite0\/model\/blocks_6\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "efficientnet-lite0\/model\/blocks_6\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_6\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_5\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_6\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_6\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_6\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_7\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_7\/Relu6_0_output",
      "K" : 80,
      "blob_biases" : 85,
      "name" : "efficientnet-lite0\/model\/blocks_7\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "efficientnet-lite0\/model\/blocks_6\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_7\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_7\/Relu6_1_0_output",
      "K" : 480,
      "blob_biases" : 89,
      "name" : "efficientnet-lite0\/model\/blocks_7\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "efficientnet-lite0\/model\/blocks_7\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_7\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_7\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 480,
      "blob_biases" : 93,
      "name" : "efficientnet-lite0\/model\/blocks_7\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "efficientnet-lite0\/model\/blocks_7\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_7\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_6\/Add_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_7\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_7\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_7\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_8\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_8\/Relu6_0_output",
      "K" : 80,
      "blob_biases" : 97,
      "name" : "efficientnet-lite0\/model\/blocks_8\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "efficientnet-lite0\/model\/blocks_7\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_8\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_8\/Relu6_1_0_output",
      "K" : 480,
      "blob_biases" : 101,
      "name" : "efficientnet-lite0\/model\/blocks_8\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "efficientnet-lite0\/model\/blocks_8\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_8\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_8\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 480,
      "blob_biases" : 105,
      "name" : "efficientnet-lite0\/model\/blocks_8\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "efficientnet-lite0\/model\/blocks_8\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_9\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_9\/Relu6_0_output",
      "K" : 112,
      "blob_biases" : 109,
      "name" : "efficientnet-lite0\/model\/blocks_9\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "efficientnet-lite0\/model\/blocks_8\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_9\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_9\/Relu6_1_0_output",
      "K" : 672,
      "blob_biases" : 113,
      "name" : "efficientnet-lite0\/model\/blocks_9\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 672,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "efficientnet-lite0\/model\/blocks_9\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_9\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_9\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 672,
      "blob_biases" : 117,
      "name" : "efficientnet-lite0\/model\/blocks_9\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "efficientnet-lite0\/model\/blocks_9\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_9\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_8\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_9\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_9\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_9\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_10\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_10\/Relu6_0_output",
      "K" : 112,
      "blob_biases" : 121,
      "name" : "efficientnet-lite0\/model\/blocks_10\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "efficientnet-lite0\/model\/blocks_9\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_10\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_10\/Relu6_1_0_output",
      "K" : 672,
      "blob_biases" : 125,
      "name" : "efficientnet-lite0\/model\/blocks_10\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 672,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "efficientnet-lite0\/model\/blocks_10\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_10\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_10\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 672,
      "blob_biases" : 129,
      "name" : "efficientnet-lite0\/model\/blocks_10\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "efficientnet-lite0\/model\/blocks_10\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_10\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_9\/Add_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_10\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_10\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_10\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_11\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_11\/Relu6_0_output",
      "K" : 112,
      "blob_biases" : 133,
      "name" : "efficientnet-lite0\/model\/blocks_11\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "efficientnet-lite0\/model\/blocks_10\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_11\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_11\/Relu6_1_0_output",
      "K" : 672,
      "blob_biases" : 137,
      "stride_x" : 2,
      "name" : "efficientnet-lite0\/model\/blocks_11\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 672,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "efficientnet-lite0\/model\/blocks_11\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_11\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_11\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 672,
      "blob_biases" : 141,
      "name" : "efficientnet-lite0\/model\/blocks_11\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "efficientnet-lite0\/model\/blocks_11\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_12\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_12\/Relu6_0_output",
      "K" : 192,
      "blob_biases" : 145,
      "name" : "efficientnet-lite0\/model\/blocks_12\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_11\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_12\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_12\/Relu6_1_0_output",
      "K" : 1152,
      "blob_biases" : 149,
      "name" : "efficientnet-lite0\/model\/blocks_12\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1152,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_12\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_12\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_12\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 1152,
      "blob_biases" : 153,
      "name" : "efficientnet-lite0\/model\/blocks_12\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "efficientnet-lite0\/model\/blocks_12\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_12\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_11\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_12\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_12\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_12\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_13\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_13\/Relu6_0_output",
      "K" : 192,
      "blob_biases" : 157,
      "name" : "efficientnet-lite0\/model\/blocks_13\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_12\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_13\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_13\/Relu6_1_0_output",
      "K" : 1152,
      "blob_biases" : 161,
      "name" : "efficientnet-lite0\/model\/blocks_13\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1152,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_13\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_13\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_13\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 1152,
      "blob_biases" : 165,
      "name" : "efficientnet-lite0\/model\/blocks_13\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "efficientnet-lite0\/model\/blocks_13\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_13\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_12\/Add_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_13\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_13\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_13\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_14\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_14\/Relu6_0_output",
      "K" : 192,
      "blob_biases" : 169,
      "name" : "efficientnet-lite0\/model\/blocks_14\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_13\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 171
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_14\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_14\/Relu6_1_0_output",
      "K" : 1152,
      "blob_biases" : 173,
      "name" : "efficientnet-lite0\/model\/blocks_14\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1152,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_14\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 175
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_14\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_14\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output",
      "K" : 1152,
      "blob_biases" : 177,
      "name" : "efficientnet-lite0\/model\/blocks_14\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "efficientnet-lite0\/model\/blocks_14\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 179
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_14\/tpu_batch_normalization_2\/FusedBatchNormV3_0_output,efficientnet-lite0\/model\/blocks_13\/Add_0_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_14\/Add_0",
      "top" : "efficientnet-lite0\/model\/blocks_14\/Add_0_output",
      "type" : "elementwise",
      "name" : "efficientnet-lite0\/model\/blocks_14\/Add_0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_15\/conv2d\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_15\/Relu6_0_output",
      "K" : 192,
      "blob_biases" : 181,
      "name" : "efficientnet-lite0\/model\/blocks_15\/conv2d\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_14\/Add_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 183
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_15\/depthwise_conv2d\/depthwise_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "efficientnet-lite0\/model\/blocks_15\/Relu6_1_0_output",
      "K" : 1152,
      "blob_biases" : 185,
      "name" : "efficientnet-lite0\/model\/blocks_15\/depthwise_conv2d\/depthwise_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1152,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1152,
      "bottom" : "efficientnet-lite0\/model\/blocks_15\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 187
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "efficientnet-lite0\/model\/blocks_15\/conv2d_1\/Conv2D_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fine_relu_output",
      "K" : 1152,
      "name" : "efficientnet-lite0\/model\/blocks_15\/conv2d_1\/Conv2D_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 320,
      "bottom" : "efficientnet-lite0\/model\/blocks_15\/Relu6_1_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 189
    },
    {
      "top" : "up_sampling2d_1_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "fine_relu_output",
      "debug_info" : "up_sampling2d_1",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_1",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_1_output",
      "K" : 672,
      "blob_biases" : 191,
      "name" : "conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "efficientnet-lite0\/model\/blocks_11\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 193
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_2_output",
      "K" : 320,
      "blob_biases" : 195,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "up_sampling2d_1_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 197
    },
    {
      "bottom" : "conv2d_1_output,conv2d_2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_1",
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "bottom" : "add_1_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_1",
      "top" : "activation_1_output",
      "type" : "activation",
      "name" : "activation_1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_3_output",
      "K" : 80,
      "blob_biases" : 199,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "activation_1_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 201
    },
    {
      "bottom" : "conv2d_3_output",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "activation_2",
      "top" : "activation_2_output",
      "type" : "activation",
      "name" : "activation_2"
    },
    {
      "bottom" : "efficientnet-lite0\/model\/blocks_11\/Relu6_0_output,activation_2_output",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "multiply_1",
      "top" : "multiply_1_output",
      "type" : "elementwise",
      "name" : "multiply_1",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_1",
      "top" : "concatenate_1_output",
      "type" : "concat",
      "name" : "concatenate_1",
      "bottom" : "up_sampling2d_1_output,multiply_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_1_output",
      "K" : 992,
      "blob_biases" : 203,
      "name" : "conv2d_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "concatenate_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 205
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_2_output",
      "K" : 64,
      "blob_biases" : 207,
      "name" : "conv2d_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "re_lu_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 209
    },
    {
      "top" : "up_sampling2d_2_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "re_lu_2_output",
      "debug_info" : "up_sampling2d_2",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_2",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_6_output",
      "K" : 240,
      "blob_biases" : 211,
      "name" : "conv2d_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "efficientnet-lite0\/model\/blocks_5\/Relu6_0_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
